# Reference Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Reference Properties
Reference Class See Also
---
The Reference type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementId | The element id for this reference. |
| ElementReferenceType | The type of reference. |
| GlobalPoint | The position on which the reference is hit. |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| LinkedElementId | The id of the top-level element in the linked document that is referred to by this reference. |
| UVPoint | The UV parameters of the reference, if the reference contains a face. |

# See Also
Reference Class
Autodesk.Revit.DB Namespace